#1. Найти сумму квадратов чётных чисел на промежутке от 1 до n. 
# Пример: n=5: [1, 2, 3, 4 ,5] --> 2^2 + 4^2 = 20

n = int(input('Введите {n}-->>>'))
# n = 5
list1 = [sum((i**2) for i in range(1,n+1) if not i % 2), ]
print(list1)