# 4. Даны списки: a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
#  b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]. 
# Нужно вернуть список, который состоит из элементов, общих для этих двух списков 
# ( в данном случае ответ: [1, 2, 3, 5, 8, 13] ).

# # a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
# c = []
# с = c.append(set(a).intersection(set(b)))
# print(c)

a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
# c = [i for i in b if i in a]
c = list(filter(lambda i: i  in b,a))
#res = list(filter(lambda x: x in b, a))
print(c)


# 3 вариант
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
# unitedList = set(filter(lambda i: i in b, a))
# print(list(unitedList))


# Еще вариант решение через встроенные функции
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
# c = set(a).intersection(set(b))
# print(list(c))

