# Проверить истинность утверждения ¬(X ⋁ Y) = ¬X ⋀ ¬Y
#                               not (X )
# Конъюнкция (Логическое умножение):  F = A & B.  // F = A * B
# Дизъюнкция (Логическое сложение) :  F = A + B.
# Инверсия (Логическое отрицание)  :  A = !A
# Импликация(Логическое следование):  
# Эквивалентность (Логическая равнозначность):  A	B	F
                                            #   1	1	1
                                            #   1	0	0
                                            #   0	1	0
                                            #   0	0	1
