# Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

import os
def clear(): return os.system('cls')


clear()
list = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
list2 = "qwe"
count = 0

for i in range(len(list)):
    if list[i] == list2:
        count += 1
        if count == 2:
            print(i)
            break
